[
{
    "title": "This website!",
    "body": "For my small personal site I wanted to learn Bootstrap and combine it with a Vapor backend deployed on the cloud. Although learning enough HTML/CSS to make my site looks not terrible took longer than I expected, I think I get some bragging rights for building my own site from scratch. I've included the code for the whole website/server with a lot more details on GitHub in the hopes that this can help someone using Swift on the server get a simple website up and running in less than it took me.",
    "link": null,
},
{
    "title": "First iOS App",
    "body": "Since late 2020 I have been developing my first iOS app with the goal of putting enterprise-level horticulture tools in the hands of all cannabis growers. The inspiration came from trying to automate my small recreational grow and realizing that I needed better ways to keep track of everything and planning out next steps. It's built using SwiftUI and ready for beta testing shortly!",
    "link": null,
},
{
    "title": "Charlie Charles",
    "body": "As mentioned above, I am the proud founder of my startup currently focused on building great apps and providing consulting and freelance services, more recently for Swift and iOS projects that use technologies and platforms like Vapor, Google Cloud, and GraphQL. There are also some cool projects in the pipeline involving Python, TensorFlow, and Solidity. Contact email is info@charliecharles.biz",
    "link": null,
},
{
    "title": "Blockchain/Crypto Community Involvment",
    "body": "I have been keenly interested in the blockchain/crypto space since first learning about it in 2016 by trading my first coin which I believe was IOTA. After trying out different indicators for some time I have been dipping my toes in algorithmic trading waters. I plan to release periodic educational content covering the implementation of these indicators and other parts of a strategy in Python and maybe even some in Swift. \n As of Jan 2021 I have also been functioning as part-time Operations Manager with Blockchain Puerto, a non-profit startup focused on spreading awareness and education by joining forces between the Hispanic crypto/Blockchain community and the world. I maintain the GitHub repositories and lead the Multilingual Blockchain Glossary project. You can also spot me along with the founder on Clubhouse rooms regularly having discussions with the community.",
    "link": "https://github.com/Blockchain-Puerto-Rico",
},
{
    "title": "Financial Risk Tool",
    "body": "Tailored the Monte Carlo simulation method for predicting cash flow by modeling real-world constraints with probability distributions. This project started as my engineering capstone in 2018 with the idea of creating something that both investors and entrepreneurs could use to evaluate their startups. The project has since lived on in Python form on my GitHub (watch me turn it into a Swift project later on).",
    "link": "https://github.com/cacarle/MontePy",
},
{
    "title": "",
    "body": "",
    "link": "",
}
]

